In [3]:
import pandas as pd
import numpy as np

# Series

In [11]:
# Creating a Pandas Series from a List
population_series = [10000,20000,60000]
series_pop = pd.Series(population_series)
print(series_pop)

# Creating a Series from a NumPy Array
np_arr = np.array(population_series)
np_arr_pop = pd.Series(np_arr)
print(np_arr_pop)

0    10000
1    20000
2    60000
dtype: int64
0    10000
1    20000
2    60000
dtype: int64

In [7]:
# Creating a Series with a Custom Index
cities = ['A','B','C']
series_idx = pd.Series(population_series, index=cities)
print(series_idx)

A    10000
B    20000
C    60000
dtype: int64

# DataFrame

In [8]:
# Creating a Pandas DataFrame from a Dictionary
student_data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [21, 22, 20, 23],
    'Score': [85, 90, 78, 92]
}

frame_pd = pd.DataFrame(student_data)
print(frame_pd)

      Name  Age  Score
0    Alice   21     85
1      Bob   22     90
2  Charlie   20     78
3    David   23     92

In [14]:
# Creating a DataFrame with a Custom Row Index
rollno = [100,200,300,400]
frame_id = pd.DataFrame(student_data, index=rollno)
print(frame_id)


# Creating a DataFrame from a 2D NumPy Array
np_2d = np.array([
    ['Ramesh',90,93],
    ['Rahul',99,100],
    ['Rohit',87,89],
    ['Ronit',90,23]])
idx = np.array([10,20,30,40])
col_name = np.array(['Name','Maths_marks','English_marks'])
frame_pd_2d = pd.DataFrame(np_2d, index=idx, columns = col_name)
print(frame_pd_2d)

        Name  Age  Score
100    Alice   21     85
200      Bob   22     90
300  Charlie   20     78
400    David   23     92
      Name Maths_marks English_marks
10  Ramesh          90            93
20   Rahul          99           100
30   Rohit          87            89
40   Ronit          90            23

# Indexing and Selecting with loc and iloc

"loc": Label-based. Use when you know the names of rows/columns. Slicing is inclusive of the end label.

"iloc": Integer-location based. Use when you know the numerical position of rows/columns. Slicing is exclusive of the end position (standard Python slicing).

In [15]:
print("Sample data: ")
print(frame_id)

Sample data:
        Name  Age  Score
100    Alice   21     85
200      Bob   22     90
300  Charlie   20     78
400    David   23     92

In [19]:
# Select the row with index '300'
data = frame_id.loc[300]
print(data)

print("" + "="*30 + "")
# Select rows for Alice & David
data1 = frame_id.loc[[100,400]]
print(data1)

Name     Charlie
Age           20
Score         78
Name: 300, dtype: object
==============================
      Name  Age  Score
100  Alice   21     85
400  David   23     92

In [22]:
# Selecting Columns with loc
data2 = frame_id.loc[:,'Name']   # : -> denotes to select all
print(data2)

print("" + "="*30 + "")
# Select cols for Name & Score
data3 = frame_id.loc[:,['Name','Score']]
print(data3)

100      Alice
200        Bob
300    Charlie
400      David
Name: Name, dtype: object
==============================
        Name  Score
100    Alice     85
200      Bob     90
300  Charlie     78
400    David     92

In [27]:
# Select 'Age' and 'Score' for Bob and Charlie
age_score_bob_charlie = frame_id.loc[[200, 300], ['Age', 'Score']]
print("Age and Score for Bob and Charlie:")
print(age_score_bob_charlie)

Age and Score for Bob and Charlie:
     Age  Score
200   22     90
300   20     78

In [34]:
# Selecting rows with iloc
row1 = frame_id.iloc[0]
print(row1)

Name     Alice
Age         21
Score       85
Name: 100, dtype: object

In [35]:
# Selecting 1st and 3rd row
row2 = frame_id.iloc[[0,2]]
print(row2)

        Name  Age  Score
100    Alice   21     85
300  Charlie   20     78

In [37]:
# Selecting Columns with iloc
col1 = frame_id.iloc[:,1]
print(col1)

col2 = frame_id.iloc[:,[0,1]]
print(col2)

100    21
200    22
300    20
400    23
Name: Age, dtype: int64
        Name  Age
100    Alice   21
200      Bob   22
300  Charlie   20
400    David   23

# Slicing with 'loc'

In [31]:
# Select all columns for students from 200 to 400
data4 = frame_id.loc[200:400]
print(data4)

print("" + "="*30 + "")
# Select all columns for students from 200 to 400 with names
data5 = frame_id.loc[200:400,'Name']
print(data5)

        Name  Age  Score
200      Bob   22     90
300  Charlie   20     78
400    David   23     92
==============================
200        Bob
300    Charlie
400      David
Name: Name, dtype: object

In [39]:
# Slicing with iloc
# Selecting all cols from 1 to 2
row_sli1 = frame_id.iloc[1:3]    # last idx not inclusive
print(row_sli1)

        Name  Age  Score
200      Bob   22     90
300  Charlie   20     78

In [40]:
# Select 'Name' column (position 0) for all students 
col_scli1 = frame_id.iloc[:,0]
print(col_scli1)

100      Alice
200        Bob
300    Charlie
400      David
Name: Name, dtype: object

# Essential DataFrame Attributes

In [47]:
print("DataFrame index: ", frame_id.index)
print("" + "="*30 + "")
print("DataFrame columns: ", frame_id.columns)
print("" + "="*30 + "")
print("DataFrame values: ", frame_id.values)
print("" + "="*30 + "")
print("DataFrame shape: ", frame_id.shape)
print("" + "="*30 + "")
print("DataFrame data-type: ", frame_id.dtypes)

DataFrame index:  Index([100, 200, 300, 400], dtype='int64')
==============================
DataFrame columns:  Index(['Name', 'Age', 'Score'], dtype='object')
==============================
DataFrame values:  [['Alice' 21 85]
 ['Bob' 22 90]
 ['Charlie' 20 78]
 ['David' 23 92]]
==============================
DataFrame shape:  (4, 3)
==============================
DataFrame data-type:  Name     object
Age       int64
Score     int64
dtype: object

# Essential DataFrame Methods

In [52]:
print("DataFrame starting rows: ", frame_id.head(3))
print("" + "="*30 + "")
print("DataFrame last rows: ", frame_id.tail(3))
print("" + "="*30 + "")
print("DataFrame summary: ", frame_id.info(3))
print("" + "="*30 + "")
print("Describe DataFrame: ", frame_id.describe())
print("" + "="*30 + "")
print("DataFrame Transpose: ", frame_id.T)

DataFrame starting rows:          Name  Age  Score
100    Alice   21     85
200      Bob   22     90
300  Charlie   20     78
==============================
DataFrame last rows:          Name  Age  Score
200      Bob   22     90
300  Charlie   20     78
400    David   23     92
==============================
<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 100 to 400
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes
DataFrame summary:  None
==============================
Describe DataFrame:               Age      Score
count   4.000000   4.000000
mean   21.500000  86.250000
std     1.290994   6.238322
min    20.000000  78.000000
25%    20.750000  83.250000
50%    21.500000  87.500000
75%    22.250000  90.500000
max    23.000000  92.000000
==============================
DataFrame Transpose:           100  200      300    400
Name   Alice  Bob  Charlie  David
Age       21   22       20     23
Score     85   90       78     92

# Data loading & Cleaning

In [55]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, np.nan, 22, 28],
    'City': ['New York', np.nan, 'Los Angeles', 'Chicago', 'New York'],
    'Salary': [70000, 80000, 65000, np.nan, 72000]
}

df = pd.DataFrame(data)   # Read data
print(df)

      Name   Age         City   Salary
0    Alice  25.0     New York  70000.0
1      Bob  30.0          NaN  80000.0
2  Charlie   NaN  Los Angeles  65000.0
3    David  22.0      Chicago      NaN
4      Eve  28.0     New York  72000.0

In [63]:
# checking if there is any null value in data
print(df.isnull())  # True means -> cell has null values

print("" + "="*30 + "")
# checking where the value is not null
print(df.notnull())   # True means -> cell dont has null values

print("" + "="*30 + "")
# Count missing values per column
print('Number of missing values per column:')
print( df.isnull().sum())

print("" + "="*30 + "")
# Calculate the percentage of missing values per column
print('% of missing values per col: ')
print((df.isnull().sum() / len(df))*100)

    Name    Age   City  Salary
0  False  False  False   False
1  False  False   True   False
2  False   True  False   False
3  False  False  False    True
4  False  False  False   False
==============================
   Name    Age   City  Salary
0  True   True   True    True
1  True   True  False    True
2  True  False   True    True
3  True   True   True   False
4  True   True   True    True
==============================
Number of missing values per column:
Name      0
Age       1
City      1
Salary    1
dtype: int64
==============================
% of missing values per col:
Name       0.0
Age       20.0
City      20.0
Salary    20.0
dtype: float64

# Handling Duplicate values

In [65]:
# Create a sample DataFrame with duplicate rows
data_dup = {
    'ID': [1, 2, 3, 1, 4, 2, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'David', 'Bob', 'Eve'],
    'Value': [100, 200, 150, 100, 300, 200, 250]
}

df_dup = pd.DataFrame(data_dup)
print(df_dup)

   ID     Name  Value
0   1    Alice    100
1   2      Bob    200
2   3  Charlie    150
3   1    Alice    100
4   4    David    300
5   2      Bob    200
6   5      Eve    250

In [69]:
# Identify duplicate rows (marks subsequent occurrences as True)
print(df_dup.duplicated())

print("" + "="*30 + "")
# Show the actual duplicate rows
print(df_dup[df_dup.duplicated()])

print("" + "="*30 + "")
# Count the number of duplicate rows
print('Number of duplicated rows: ', df_dup.duplicated().sum())

0    False
1    False
2    False
3     True
4    False
5     True
6    False
dtype: bool
==============================
   ID   Name  Value
3   1  Alice    100
5   2    Bob    200
==============================
Number of duplicated rows:  2

# Structuring Your Data: Renaming Columns and Resetting Indices

In [71]:
data_rename = {
    'cust_id': [101, 102, 103],
    'ord_dt': ['2023-01-15', '2023-01-16', '2023-01-17'],
    'prod_nm': ['Widget A', 'Gadget B', 'Thingamajig C'],
    'amt': [50.50, 75.25, 120.00]
}
df_rename = pd.DataFrame(data_rename)
print(df_rename)

   cust_id      ord_dt        prod_nm     amt
0      101  2023-01-15       Widget A   50.50
1      102  2023-01-16       Gadget B   75.25
2      103  2023-01-17  Thingamajig C  120.00

In [72]:
# Rename specific columns using a dictionary
new_col = {
    'cust_id': 'customerID',
    'ord_dt': 'OrderDate',
    'prod_nm': 'ProductName',
    'amt': 'Amount'
}
df_new = df_rename.rename(columns = new_col)
print(df_new)

   customerID   OrderDate    ProductName  Amount
0         101  2023-01-15       Widget A   50.50
1         102  2023-01-16       Gadget B   75.25
2         103  2023-01-17  Thingamajig C  120.00

# Ensuring Data Consistency: Data Type Conversion

In [83]:
data_types = {
    'ProductID': ['101', '102', '103', '104'],
    'Quantity': ['5', '10', '7', '12'],
    'Price': [25.50, 10.00, 30.75, 15.20],
    'OrderDate': ['2023-03-10', '2023-03-11', '2023-03-10', '2023-03-12'],
    'IsShipped': ['True', 'False', 'True', 'True']
}

df_type = pd.DataFrame(data_types)
print(df_type)

  ProductID Quantity  Price   OrderDate IsShipped
0       101        5  25.50  2023-03-10      True
1       102       10  10.00  2023-03-11     False
2       103        7  30.75  2023-03-10      True
3       104       12  15.20  2023-03-12      True

In [84]:
# Data types of data 
print('Data types before type conversion: ')
print(df_type.dtypes)

Data types before type conversion:
ProductID     object
Quantity      object
Price        float64
OrderDate     object
IsShipped     object
dtype: object

In [85]:
# Convert 'ProductID' from string to integer
df_type['ProductID'] = df_type['ProductID'].astype(int)

# Convert 'Quantity' from string to integer
df_type['Quantity'] = df_type['Quantity'].astype(int)

# Convert 'OrderDate' from string to datetime objects
df_type['OrderDate'] = pd.to_datetime(df_type['OrderDate'])

# Convert 'IsShipped' from string to boolean
df_type['IsShipped'] = df_type['IsShipped'].astype(bool)

In [86]:
print('Data types after type conversion: ')
print(df_type.dtypes)

Data types after type conversion:
ProductID             int64
Quantity              int64
Price               float64
OrderDate    datetime64[ns]
IsShipped              bool
dtype: object

# Manipulating Text Data: Basic String Operations on Columns

In [87]:
data_strings = {
    'Email': ['  alice@example.com  ', 'bob@DOMAIN.COM', 'charlie@example.com', 'david@EXAMPLE.COM '],
    'ProductName': ['  Super Widget  ', 'Mega Gadget', '  Ultra Thingamajig', 'Super Widget']
}

df_str = pd.DataFrame(data_strings)
print(df_str)

                   Email          ProductName
0    alice@example.com         Super Widget
1         bob@DOMAIN.COM          Mega Gadget
2    charlie@example.com    Ultra Thingamajig
3     david@EXAMPLE.COM          Super Widget

In [88]:
# 1. Removing leading/trailing whitespace with .str.strip()
df_str['Email'] = df_str['Email'].str.strip()
df_str['ProductName'] = df_str['ProductName'].str.strip()
print(df_str)

                 Email        ProductName
0    alice@example.com       Super Widget
1       bob@DOMAIN.COM        Mega Gadget
2  charlie@example.com  Ultra Thingamajig
3    david@EXAMPLE.COM       Super Widget

In [90]:
# 2. Converting to lowercase with .str.lower()
df_str['Email'] = df_str['Email'].str.lower()
df_str['ProductName'] = df_str['ProductName'].str.lower()
print(df_str)

                 Email        ProductName
0    alice@example.com       super widget
1       bob@domain.com        mega gadget
2  charlie@example.com  ultra thingamajig
3    david@example.com       super widget

In [92]:
# 3. Splitting strings with .str.split()
# Let's split the email into username and domain
email_split = df_str['Email'].str.split('@',expand=True)
email_split.columns = ['Username','Domain']   # Rename columns for clarity
df_str = pd.concat([df_str, email_split],axis=1) # Adding new cols to database
print(df_str)

                 Email        ProductName Username       Domain
0    alice@example.com       super widget    alice  example.com
1       bob@domain.com        mega gadget      bob   domain.com
2  charlie@example.com  ultra thingamajig  charlie  example.com
3    david@example.com       super widget    david  example.com

In [94]:
# 4. Extracting substrings or patterns with .str.extract() (using regex)
# Extracting the domain again, this time using regex for practice
df_str['ExtractedDomain'] = df_str['Email'].str.extract(r'@(.*)')
print(df_str)

                 Email        ProductName Username       Domain  \
0    alice@example.com       super widget    alice  example.com
1       bob@domain.com        mega gadget      bob   domain.com
2  charlie@example.com  ultra thingamajig  charlie  example.com
3    david@example.com       super widget    david  example.com

  ExtractedDomain
0     example.com
1      domain.com
2     example.com
3     example.com

In [97]:
# 5. Replacing substrings with .str.replace()
df_str['ProductName'] = df_str['ProductName'].str.replace('super','premium',regex=False)  # Case-sensitive replacement -> replace 'super' with 'premium'
print(df_str)

                 Email        ProductName Username       Domain  \
0    alice@example.com     premium widget    alice  example.com
1       bob@domain.com        mega gadget      bob   domain.com
2  charlie@example.com  ultra thingamajig  charlie  example.com
3    david@example.com     premium widget    david  example.com

  ExtractedDomain
0     example.com
1      domain.com
2     example.com
3     example.com

# Data transformation and aggregation

# Filtering Records Based on Conditions

In [98]:
# Filtering Single Column
older_than_30 = df[df['Age'] > 30]
print(older_than_30)

Empty DataFrame
Columns: [Name, Age, City, Salary]
Index: []

In [107]:
# Filtering with Multiple Conditions
ny_and_older_25 = df[(df['City'] == 'New York') & (df['Age'] > 25)]

paris_or_young = df[(df['City'] == 'Paris') | (df['Age'] < 20)]

not_tokyo = df[~(df['City'] == 'Tokyo')]

print(ny_and_older_25)
print(paris_or_young)
print(not_tokyo)

  Name   Age      City   Salary
4  Eve  28.0  New York  72000.0
Empty DataFrame
Columns: [Name, Age, City, Salary]
Index: []
      Name   Age         City   Salary
0    Alice  25.0     New York  70000.0
1      Bob  30.0          NaN  80000.0
2  Charlie   NaN  Los Angeles  65000.0
3    David  22.0      Chicago      NaN
4      Eve  28.0     New York  72000.0

In [106]:
# Using the .isin() Method
selected_cities = ['London','New York','Berlin']
print(df[df['City'].isin(selected_cities)])

    Name   Age      City   Salary
0  Alice  25.0  New York  70000.0
4    Eve  28.0  New York  72000.0

In [105]:
# Using the .str Accessor for String Operations
print(df_str[df_str['Email'].str.contains('example.com')])
print(df[df['Name'].str.startswith('A')])

                 Email        ProductName Username       Domain  \
0    alice@example.com     premium widget    alice  example.com
2  charlie@example.com  ultra thingamajig  charlie  example.com
3    david@example.com     premium widget    david  example.com

  ExtractedDomain
0     example.com
2     example.com
3     example.com
    Name   Age      City   Salary
0  Alice  25.0  New York  70000.0

# Sorting DataFrames for Better Insights

In [113]:
# sorting in ascending order
sorted_str = df_str.sort_values(by='ProductName')
print(sorted_str)

print("="*70)
# sorting in descending order
sorted_str = df_str.sort_values(by='ProductName', ascending=False)
print(sorted_str)

print("="*70)
# sorting by multiple orders
sorted_str = df_str.sort_values(by=['ProductName','Username'],ascending=[True,False])
print(sorted_str)

                 Email        ProductName Username       Domain  \
1       bob@domain.com        mega gadget      bob   domain.com
0    alice@example.com     premium widget    alice  example.com
3    david@example.com     premium widget    david  example.com
2  charlie@example.com  ultra thingamajig  charlie  example.com

  ExtractedDomain
1      domain.com
0     example.com
3     example.com
2     example.com
======================================================================
                 Email        ProductName Username       Domain  \
2  charlie@example.com  ultra thingamajig  charlie  example.com
0    alice@example.com     premium widget    alice  example.com
3    david@example.com     premium widget    david  example.com
1       bob@domain.com        mega gadget      bob   domain.com

  ExtractedDomain
2     example.com
0     example.com
3     example.com
1      domain.com
======================================================================
                 Email        ProductName Username       Domain  \
1       bob@domain.com        mega gadget      bob   domain.com
3    david@example.com     premium widget    david  example.com
0    alice@example.com     premium widget    alice  example.com
2  charlie@example.com  ultra thingamajig  charlie  example.com

  ExtractedDomain
1      domain.com
3     example.com
0     example.com
2     example.com

# Grouping data with 'groupby()'

In [116]:
# Grouping by a Single Column
df_news = df_type.groupby('IsShipped')
print(df_news.groups)

{True: [0, 1, 2, 3]}

In [118]:
# Group by Multiple Columns
df_col = df_type.groupby(['OrderDate', 'IsShipped'])
print(df_col.groups)

{(2023-03-10 00:00:00, True): [0, 2], (2023-03-11 00:00:00, True): [1], (2023-03-12 00:00:00, True): [3]}

In [124]:
# You can access individual groups using the .get_group() method
df_group = df_news.get_group(True)
print(df_group)

   ProductID  Quantity  Price  OrderDate  IsShipped
0        101         5  25.50 2023-03-10       True
1        102        10  10.00 2023-03-11       True
2        103         7  30.75 2023-03-10       True
3        104        12  15.20 2023-03-12       True

# Calculating Average Purchase Amount per Category within Each City

In [132]:
data = {
    'CustomerID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112],
    'City': ['New York', 'Los Angeles', 'Chicago', 'New York', 'Los Angeles', 'Chicago', 'New York', 'Los Angeles', 'Chicago', 'New York', 'Los Angeles', 'Chicago'],
    'PurchaseAmount': [150.50, 220.75, 95.00, 310.20, 180.00, 450.50, 75.90, 290.00, 120.00, 550.00, 210.00, 300.00],
    'Category': ['Electronics', 'Clothing', 'Home Goods', 'Electronics', 'Clothing', 'Home Goods', 'Electronics', 'Clothing', 'Home Goods', 'Electronics', 'Clothing', 'Home Goods']
}

df_cust = pd.DataFrame(data)
print(df_cust)

    CustomerID         City  PurchaseAmount     Category
0          101     New York          150.50  Electronics
1          102  Los Angeles          220.75     Clothing
2          103      Chicago           95.00   Home Goods
3          104     New York          310.20  Electronics
4          105  Los Angeles          180.00     Clothing
5          106      Chicago          450.50   Home Goods
6          107     New York           75.90  Electronics
7          108  Los Angeles          290.00     Clothing
8          109      Chicago          120.00   Home Goods
9          110     New York          550.00  Electronics
10         111  Los Angeles          210.00     Clothing
11         112      Chicago          300.00   Home Goods

In [133]:
# Group by City and Category
df_cust_grp = df_cust.groupby(['City','Category'])

In [142]:
# Apply the Mean Aggregation to PurchaseAmount
df_cust_mean = df_cust_grp['PurchaseAmount'].mean()
print(df_cust_mean)

City         Category
Chicago      Home Goods     241.3750
Los Angeles  Clothing       225.1875
New York     Electronics    271.6500
Name: PurchaseAmount, dtype: float64

In [144]:
# Resetting the Index for a Flat DataFrame
df_cust_reset = (
    df_cust_mean
    .rename('AvgPurchaseAmount')   # rename Series
    .reset_index()
)

print(df_cust_reset)

          City     Category  AvgPurchaseAmount
0      Chicago   Home Goods           241.3750
1  Los Angeles     Clothing           225.1875
2     New York  Electronics           271.6500

# Combining Datasets: Merging and Joining DataFrames

merged_df = pd.merge(left_df, right_df, on='key_column', how='join_type')

Key parameters:

'left_df', 'right_df': The DataFrames to merge.

'on': The column name(s) to join on. If column names are different in the two DataFrames, use left_on and right_on.

'how': Specifies the type of join. Common options are:

    'inner' (default): Returns only rows where the key exists in *both* DataFrames.
    'left': Returns all rows from the left DataFrame and matching rows from the right. If no match, NaN is used for right DataFrame columns.
    'right': Returns all rows from the right DataFrame and matching rows from the left. If no match, NaN is used for left DataFrame columns.
    'outer': Returns all rows from *both* DataFrames. If no match, NaN is used.

In [145]:
# DataFrame 1: Customer Demographics
data_customers = {
    'CustomerID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'City': ['New York', 'Los Angeles', 'Chicago', 'New York', 'Los Angeles']
}
df_demographics = pd.DataFrame(data_customers)

# DataFrame 2: Order Information
data_orders = {
    'OrderID': [1, 2, 3, 4, 5, 6],
    'CustomerID': [101, 102, 101, 103, 104, 106], # Customer 106 is not in demographics
    'Product': ['Laptop', 'Keyboard', 'Mouse', 'Monitor', 'Webcam', 'Desk'],
    'Amount': [1200, 75, 25, 300, 50, 150]
}
df_orders = pd.DataFrame(data_orders)

In [148]:
merged_data_inner = pd.merge(df_demographics,df_orders,on='CustomerID',how='inner')
print(merged_data_inner)

   CustomerID     Name         City  OrderID   Product  Amount
0         101    Alice     New York        1    Laptop    1200
1         101    Alice     New York        3     Mouse      25
2         102      Bob  Los Angeles        2  Keyboard      75
3         103  Charlie      Chicago        4   Monitor     300
4         104    David     New York        5    Webcam      50

In [149]:
merged_data_left = pd.merge(df_demographics,df_orders,on='CustomerID',how='left')
print(merged_data_left)

   CustomerID     Name         City  OrderID   Product  Amount
0         101    Alice     New York      1.0    Laptop  1200.0
1         101    Alice     New York      3.0     Mouse    25.0
2         102      Bob  Los Angeles      2.0  Keyboard    75.0
3         103  Charlie      Chicago      4.0   Monitor   300.0
4         104    David     New York      5.0    Webcam    50.0
5         105      Eve  Los Angeles      NaN       NaN     NaN

In [150]:
merged_data_right = pd.merge(df_demographics,df_orders,on='CustomerID',how='right')
print(merged_data_right)

   CustomerID     Name         City  OrderID   Product  Amount
0         101    Alice     New York        1    Laptop    1200
1         102      Bob  Los Angeles        2  Keyboard      75
2         101    Alice     New York        3     Mouse      25
3         103  Charlie      Chicago        4   Monitor     300
4         104    David     New York        5    Webcam      50
5         106      NaN          NaN        6      Desk     150

In [151]:
merged_data_outer = pd.merge(df_demographics,df_orders,on='CustomerID',how='outer')
print(merged_data_outer)

   CustomerID     Name         City  OrderID   Product  Amount
0         101    Alice     New York      1.0    Laptop  1200.0
1         101    Alice     New York      3.0     Mouse    25.0
2         102      Bob  Los Angeles      2.0  Keyboard    75.0
3         103  Charlie      Chicago      4.0   Monitor   300.0
4         104    David     New York      5.0    Webcam    50.0
5         105      Eve  Los Angeles      NaN       NaN     NaN
6         106      NaN          NaN      6.0      Desk   150.0

Using DataFrame.join() = > .join() is convenient when you want to join based on the index of one DataFrame and a column of another, or when joining two DataFrames on their indices.

In [153]:
df_orders_indexed = df_orders.set_index('CustomerID')   # made the common col as index in one of the table
joined_df = df_demographics.join(df_orders_indexed, on='CustomerID', how='left')  # joined it with another table
print(joined_df)

   CustomerID     Name         City  OrderID   Product  Amount
0         101    Alice     New York      1.0    Laptop  1200.0
0         101    Alice     New York      3.0     Mouse    25.0
1         102      Bob  Los Angeles      2.0  Keyboard    75.0
2         103  Charlie      Chicago      4.0   Monitor   300.0
3         104    David     New York      5.0    Webcam    50.0
4         105      Eve  Los Angeles      NaN       NaN     NaN

Using pd.concat() => pd.concat() is used to append DataFrames either row-wise (axis=0, default) or column-wise (axis=1). It does not align based on keys like merge/join.

In [156]:
# Create two DataFrames with the same index
df_part1 = pd.DataFrame({'A': ['A0', 'A1'], 'B': ['B0', 'B1']}, index=[0, 1])
df_part2 = pd.DataFrame({'C': ['C0', 'C1'], 'D': ['D0', 'D1']}, index=[0, 1])

# Concatenate horizontally
concatenated_horizontal = pd.concat([df_part1, df_part2], axis=1)
print(concatenated_horizontal)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

# Apply() Function

The .apply() method takes a function as an argument and applies it to each row or column of a DataFrame. This function can be a built-in Python function, a lambda function, or a user-defined function.

In [159]:
def calculate_range(series):
    # Ensure the series is numeric and handle potential NaNs
    numeric_series = pd.to_numeric(series, errors='coerce')  # errors='coerce' means: If a value cannot be converted, replace it with NaN instead of throwing an error.
    if numeric_series.isnull().all():
        return np.nan
    return numeric_series.max() - numeric_series.min()

# Apply the function to each column
column_ranges = df_orders.apply(calculate_range, axis=0)

In [161]:
print(column_ranges)

OrderID          5.0
CustomerID       5.0
Product          NaN
Amount        1175.0
dtype: float64